       IDENTIFICATION DIVISION.
       PROGRAM-ID. ESCRIBE-CLIENTES.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
        SELECT CLIENTES-FILE ASSIGN TO "clientes.dat" 
                             ORGANIZATION IS LINE SEQUENTIAL.
        SELECT LAST-ID-FILE ASSIGN TO "last_id.txt"
                             ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD CLIENTES-FILE.
       01 CLIENTE.
        05 CLIENTE-ID PIC X(10).
        05 CLIENTE-NAME PIC X(30).
        05 CLIENTE-ADDRESS PIC X(60).
        05 FILLER PIC X(1000).
       FD LAST-ID-FILE.
       01 LAST-ID-RECORD.
        05 LAST-ID PIC 9(10).
       
       WORKING-STORAGE SECTION.
       01 WS-END-OF-FILE PIC X VALUE 'N'.
       01 WS-CLIENTE-ID PIC 9(10).
       01 WS-CLIENTE-ID-STR PIC X(10).
       01 WS-CLIENTE-NAME PIC X(50).
       01 WS-CLIENTE-ADDRESS PIC X(100).
       
       PROCEDURE DIVISION.
       OPEN INPUT LAST-ID-FILE.
       READ LAST-ID-FILE
         AT END MOVE 1 TO WS-CLIENTE-ID
         NOT AT END MOVE LAST-ID TO WS-CLIENTE-ID
       CLOSE LAST-ID-FILE.

       OPEN EXTEND CLIENTES-FILE.
       PERFORM UNTIL WS-END-OF-FILE = 'Y'
        MOVE WS-CLIENTE-ID TO WS-CLIENTE-ID-STR
        MOVE WS-CLIENTE-ID TO CLIENTE-ID
        DISPLAY 'Ingrese el nombre del cliente:'
        ACCEPT WS-CLIENTE-NAME
        DISPLAY 'Ingrese la dirección del cliente:'
        ACCEPT WS-CLIENTE-ADDRESS
        MOVE WS-CLIENTE-ADDRESS TO CLIENTE-ADDRESS
        WRITE CLIENTE
        ADD 1 TO WS-CLIENTE-ID
        STRING WS-CLIENTE-ID DELIMITED BY SIZE INTO WS-CLIENTE-ID-STR
       END-PERFORM
       CLOSE CLIENTES-FILE.

       OPEN OUTPUT LAST-ID-FILE.
       WRITE LAST-ID-RECORD FROM WS-CLIENTE-ID
       CLOSE LAST-ID-FILE.
       
       STOP RUN.
       